'''
المشروع الأول 
برنامج تخمين 

الوصف 

سيقوم البرنامج أولاً بإنشاء عدد غير معروف للمستخدم بشكل عشوائي. يحتاج المستخدم إلى تخمين ما هو هذا الرقم. (بمعنى آخر 
، يحتاج المستخدم إلى أن يكون قادرًا على إدخال المعلومات.) إذا كان تخمين المستخدم خاطئًا ، فيجب أن يعرض البرنامج نوعًا 
من الدلائل على مدى الخطأ (على سبيل المثال ، الرقم مرتفع جدًا أو منخفض جدًا). إذا كان المستخدم يخمن بشكل صحيح 
، يجب أن تظهر إشارة إيجابية. ستحتاج إلى وظائف للتحقق مما إذا كان إدخال المستخدم رقمًا حقيقيًا
، لمعرفة الفرق بين رقم الإدخال والأرقام التي تم إنشاؤها عشوائيًا ، ثم لمقارنة الأرقام.



مثل ماقلت سابقًا الوصف ليس تحديد لكم الجميع له حرية الإبداع 
سوا برامج تخمين ارقام و احرف كلمات سرية حسابات مستخدمين ...الخ  ومن يؤد ان يضعها ايضًا في واجهة رسومية 


ارونا ابداعتكم  pyHunters 😋

'''


#------------------ @start:zaid------------------------------

import random
print("This program is creating a random number from 0 to 9, have a moment to think...\n")
t=4
for i in range(1):
  rnd=random.randint(0,9)
  l=int(input(f"you have {t} attempts left, inser your geuss here:  "))
  while t>0:
    if l==rnd :
      print('very good guess is correct 👍🏻')
      break
    
    else:
      t-=1
      if t==0:
        print("sorry you have consumed all your attempts, goodluck next time🌹")
        break
      else:
        l=int(input(f"you have {t} attempts left, inser your geuss here:  "))
    
  
#-------------------- @end:zaid------------------------------



#------------------ @start:hadeel------------------------------












#-------------------- @end:hadeel------------------------------




#------------------ @start:khalid------------------------------












#-------------------- @end:khalid------------------------------



#------------------ @start:عبدالرحمن------------------------------











#-------------------- @end:عبدالرحمن------------------------------


#------------------ @start:ممدوح------------------------------










#-------------------- @end:ممدوح------------------------------

#------------------ @start:العنود------------------------------










#-------------------- @end:العنود------------------------------

#------------------ @start:أحمد------------------------------










#-------------------- @end:أحمد------------------------------
