'''
المشروع الثاني : برنامج أسئلة مصغر ✒️

الوصف 


المطلوب عمل برنامج يقوم باختبار المستخدم باسئلة دو أجوبة متعددة الاختيارات  بحيث لو اختار 
المستخدم الجواب الصحيح يخرجه من البرنامج وفي حين كان جواب خطأ يطلب منه اعادة ادخال رقم الجواب الصح 

مثال 💡

السؤال  ⁉️

لون فاكهة التفاح 🍎 : 
1-احمر 
2-اسود 
3-ابيض 
4- لاشيء مما سبق 


طبعا الخيار الصح 
1-احمر ✔️


ارونا ابداعتكم  pyHunters 😋

'''


#------------------ @start:zaid------------------------------

print("What is the color of the strawberry?")
print("""
please choose the number that represents the correct choice among the following answers:
  
  1. red
  2. orange
  3. yellow
  4. blue
  5. green

""")
n=int(input("insert your choice here:  "))
while n>0:
  if n==1:
    print("great, your answer is correct")
    break
  else:
    n=int(input("wrong answer, please try again:  "))
 
#-------------------- @end:zaid------------------------------



#------------------ @start:hadeel------------------------------












#-------------------- @end:hadeel------------------------------




#------------------ @start:khalid------------------------------












#-------------------- @end:khalid------------------------------



#------------------ @start:عبدالرحمن------------------------------











#-------------------- @end:عبدالرحمن------------------------------


#------------------ @start:ممدوح------------------------------










#-------------------- @end:ممدوح------------------------------

#------------------ @start:العنود------------------------------










#-------------------- @end:العنود------------------------------

#------------------ @start:أحمد------------------------------










#-------------------- @end:أحمد------------------------------
