'''
المشروع الثاني : برنامج أسئلة مصغر ✒️

الوصف 


المطلوب عمل برنامج يقوم باختبار المستخدم باسئلة دو أجوبة متعددة الاختيارات  بحيث لو اختار 
المستخدم الجواب الصحيح يخرجه من البرنامج وفي حين كان جواب خطأ يطلب منه اعادة ادخال رقم الجواب الصح 

مثال 💡

السؤال  ⁉️

لون فاكهة التفاح 🍎 : 
1-احمر 
2-اسود 
3-ابيض 
4- لاشيء مما سبق 


طبعا الخيار الصح 
1-احمر ✔️


ارونا ابداعتكم  pyHunters 😋

'''


#------------------ @start:zaid------------------------------








#-------------------- @end:zaid------------------------------



#------------------ @start:hadeel------------------------------












#-------------------- @end:hadeel------------------------------




#------------------ @start:khalid------------------------------












#-------------------- @end:khalid------------------------------



#------------------ @start:عبدالرحمن------------------------------
A = input ('Enter the name of your fruit :')

if A == 'red':
    print ('The answer is wrong Red :')
    
elif A == 'white':
    print ('Not the right color :')
    
elif A == 'Orange':
    print ('The answer is wrong :')

else :
    print ('Try again :')










#-------------------- @end:عبدالرحمن------------------------------


#------------------ @start:ممدوح------------------------------










#-------------------- @end:ممدوح------------------------------

#------------------ @start:العنود------------------------------










#-------------------- @end:العنود------------------------------

#------------------ @start:أحمد------------------------------










#-------------------- @end:أحمد------------------------------
