
'''
المطلوب عمل نظام للضريبة 😎


طبعًا باستخدام الكلاس

النظام راح يطلب الاسم و الراتب 
وراح يحدد هل الشخص يدفع ضريبة مضافة ام لا وكم قيمتها 

استنادًا ع البيانات التالية 
اقل من 
10000
لا ضريبة مضافة 


20000
الضريبة المضافة
10 % 

40000
الضريبة المضافة 
20% 

اكثر من ذلك 
الضريبة المضافة 
30%
'''

#------------------ @start:zaid------------------------------








#-------------------- @end:zaid------------------------------





#------------------ @start:khalid------------------------------












#-------------------- @end:khalid------------------------------



#------------------ @start:عبدالرحمن------------------------------











#-------------------- @end:عبدالرحمن------------------------------


#------------------ @start:ممدوح------------------------------










#-------------------- @end:ممدوح------------------------------
